In [3]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import math
import warnings; warnings.simplefilter('ignore')
from code_files_feature_extraction import *

%matplotlib inline

In [4]:
arp_df = pd.read_csv('US_Accidents_June20.csv')

In [5]:
arp_df_ts = arp_df[['ID','Start_Time']]
arp_df_ts.head(7)

    ID           Start_Time
0  A-1  2016-02-08 05:46:00
1  A-2  2016-02-08 06:07:59
2  A-3  2016-02-08 06:49:27
3  A-4  2016-02-08 07:23:34
4  A-5  2016-02-08 07:39:07
5  A-6  2016-02-08 07:44:26
6  A-7  2016-02-08 07:59:35

In [6]:
arp_df_ts.shape

(3513617, 2)

In [7]:
arp_df_ts['Date'] = pd.DatetimeIndex(arp_df_ts['Start_Time']).to_period('M')
arp_df_ts.head(7)

    ID           Start_Time     Date
0  A-1  2016-02-08 05:46:00  2016-02
1  A-2  2016-02-08 06:07:59  2016-02
2  A-3  2016-02-08 06:49:27  2016-02
3  A-4  2016-02-08 07:23:34  2016-02
4  A-5  2016-02-08 07:39:07  2016-02
5  A-6  2016-02-08 07:44:26  2016-02
6  A-7  2016-02-08 07:59:35  2016-02

In [8]:
arp_df_ts.shape

(3513617, 3)

In [9]:
arp_df_ts.drop(['Start_Time'],axis = 1, inplace=True)

In [10]:
arp_df_ts.isnull().sum()

ID      0
Date    0
dtype: int64

In [11]:
arp_df_ts.head(2)

    ID     Date
0  A-1  2016-02
1  A-2  2016-02

In [12]:
arp_df_Day = arp_df_ts.groupby('Date')['ID'].count().reset_index()
arp_df_Day.head(2)

      Date    ID
0  2016-02   985
1  2016-03  6329

In [13]:
arp_df_Day.rename(columns={'ID':'Accidents'}, inplace=True)
arp_df_Day.head(10)

      Date  Accidents
0  2016-02        985
1  2016-03       6329
2  2016-04      18088
3  2016-05      17610
4  2016-06      30527
5  2016-07      45759
6  2016-08      56425
7  2016-09      54664
8  2016-10      55628
9  2016-11      65010

In [14]:
arp_df_Day.shape

(53, 2)

In [15]:
arp_df_Day.to_csv('MonthlyAccidents.csv',index=False)

In [39]:
arp_df_Day2.to_csv(r'arp_DailyAccidents.csv',index=False)